HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_reg.h
/** \brief 43C, Write Data Section 16 */
#define ERAY0_WRDS_1S15 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C43Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S15.
* To use register names with standard convension, please use ERAY0_WRDS_1S15.
*/
#define ERAY0_WRDS16 (ERAY0_WRDS_1S15)

/** \brief 440, Write Data Section 17 */
#define ERAY0_WRDS_1S16 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C440u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S16.
* To use register names with standard convension, please use ERAY0_WRDS_1S16.
*/
#define ERAY0_WRDS17 (ERAY0_WRDS_1S16)

/** \brief 444, Write Data Section 18 */
#define ERAY0_WRDS_1S17 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C444u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S17.
* To use register names with standard convension, please use ERAY0_WRDS_1S17.
*/
#define ERAY0_WRDS18 (ERAY0_WRDS_1S17)

/** \brief 448, Write Data Section 19 */
#define ERAY0_WRDS_1S18 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C448u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S18.
* To use register names with standard convension, please use ERAY0_WRDS_1S18.
*/
#define ERAY0_WRDS19 (ERAY0_WRDS_1S18)

/** \brief 44C, Write Data Section 20 */
#define ERAY0_WRDS_1S19 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C44Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S19.
* To use register names with standard convension, please use ERAY0_WRDS_1S19.
*/
#define ERAY0_WRDS20 (ERAY0_WRDS_1S19)

/** \brief 450, Write Data Section 21 */
#define ERAY0_WRDS_1S20 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C450u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S20.
* To use register names with standard convension, please use ERAY0_WRDS_1S20.
*/
#define ERAY0_WRDS21 (ERAY0_WRDS_1S20)

/** \brief 454, Write Data Section 22 */
#define ERAY0_WRDS_1S21 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C454u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S21.
* To use register names with standard convension, please use ERAY0_WRDS_1S21.
*/
#define ERAY0_WRDS22 (ERAY0_WRDS_1S21)

/** \brief 458, Write Data Section 23 */
#define ERAY0_WRDS_1S22 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C458u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S22.
* To use register names with standard convension, please use ERAY0_WRDS_1S22.
*/
#define ERAY0_WRDS23 (ERAY0_WRDS_1S22)

/** \brief 45C, Write Data Section 24 */
#define ERAY0_WRDS_1S23 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C45Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S23.
* To use register names with standard convension, please use ERAY0_WRDS_1S23.
*/
#define ERAY0_WRDS24 (ERAY0_WRDS_1S23)

/** \brief 460, Write Data Section 25 */
#define ERAY0_WRDS_1S24 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C460u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S24.
* To use register names with standard convension, please use ERAY0_WRDS_1S24.
*/
#define ERAY0_WRDS25 (ERAY0_WRDS_1S24)

/** \brief 464, Write Data Section 26 */
#define ERAY0_WRDS_1S25 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C464u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S25.
* To use register names with standard convension, please use ERAY0_WRDS_1S25.
*/
#define ERAY0_WRDS26 (ERAY0_WRDS_1S25)

/** \brief 468, Write Data Section 27 */
#define ERAY0_WRDS_1S26 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C468u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S26.
* To use register names with standard convension, please use ERAY0_WRDS_1S26.
*/
#define ERAY0_WRDS27 (ERAY0_WRDS_1S26)

/** \brief 46C, Write Data Section 28 */
#define ERAY0_WRDS_1S27 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C46Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S27.
* To use register names with standard convension, please use ERAY0_WRDS_1S27.
*/
#define ERAY0_WRDS28 (ERAY0_WRDS_1S27)

/** \brief 470, Write Data Section 29 */
#define ERAY0_WRDS_1S28 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C470u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S28.
* To use register names with standard convension, please use ERAY0_WRDS_1S28.
*/
#define ERAY0_WRDS29 (ERAY0_WRDS_1S28)

/** \brief 474, Write Data Section 30 */
#define ERAY0_WRDS_1S29 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C474u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S29.
* To use register names with standard convension, please use ERAY0_WRDS_1S29.
*/
#define ERAY0_WRDS30 (ERAY0_WRDS_1S29)

/** \brief 478, Write Data Section 31 */
#define ERAY0_WRDS_1S30 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C478u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S30.
* To use register names with standard convension, please use ERAY0_WRDS_1S30.
*/
#define ERAY0_WRDS31 (ERAY0_WRDS_1S30)

/** \brief 47C, Write Data Section 32 */
#define ERAY0_WRDS_1S31 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C47Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S31.
* To use register names with standard convension, please use ERAY0_WRDS_1S31.
*/
#define ERAY0_WRDS32 (ERAY0_WRDS_1S31)

/** \brief 480, Write Data Section 33 */
#define ERAY0_WRDS_1S32 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C480u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S32.
* To use register names with standard convension, please use ERAY0_WRDS_1S32.
*/
#define ERAY0_WRDS33 (ERAY0_WRDS_1S32)

/** \brief 484, Write Data Section 34 */
#define ERAY0_WRDS_1S33 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C484u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S33.
* To use register names with standard convension, please use ERAY0_WRDS_1S33.
*/
#define ERAY0_WRDS34 (ERAY0_WRDS_1S33)

/** \brief 488, Write Data Section 35 */
#define ERAY0_WRDS_1S34 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C488u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S34.
* To use register names with standard convension, please use ERAY0_WRDS_1S34.
*/
#define ERAY0_WRDS35 (ERAY0_WRDS_1S34)

/** \brief 48C, Write Data Section 36 */
#define ERAY0_WRDS_1S35 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C48Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S35.
* To use register names with standard convension, please use ERAY0_WRDS_1S35.
*/
#define ERAY0_WRDS36 (ERAY0_WRDS_1S35)

/** \brief 490, Write Data Section 37 */
#define ERAY0_WRDS_1S36 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C490u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S36.
* To use register names with standard convension, please use ERAY0_WRDS_1S36.
*/
#define ERAY0_WRDS37 (ERAY0_WRDS_1S36)

/** \brief 494, Write Data Section 38 */
#define ERAY0_WRDS_1S37 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C494u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S37.
* To use register names with standard convension, please use ERAY0_WRDS_1S37.
*/
#define ERAY0_WRDS38 (ERAY0_WRDS_1S37)

/** \brief 498, Write Data Section 39 */
#define ERAY0_WRDS_1S38 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C498u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S38.
* To use register names with standard convension, please use ERAY0_WRDS_1S38.
*/
#define ERAY0_WRDS39 (ERAY0_WRDS_1S38)

/** \brief 49C, Write Data Section 40 */
#define ERAY0_WRDS_1S39 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C49Cu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S39.
* To use register names with standard convension, please use ERAY0_WRDS_1S39.
*/
#define ERAY0_WRDS40 (ERAY0_WRDS_1S39)

/** \brief 4A0, Write Data Section 41 */
#define ERAY0_WRDS_1S40 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4A0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S40.
* To use register names with standard convension, please use ERAY0_WRDS_1S40.
*/
#define ERAY0_WRDS41 (ERAY0_WRDS_1S40)

/** \brief 4A4, Write Data Section 42 */
#define ERAY0_WRDS_1S41 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4A4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S41.
* To use register names with standard convension, please use ERAY0_WRDS_1S41.
*/
#define ERAY0_WRDS42 (ERAY0_WRDS_1S41)

/** \brief 4A8, Write Data Section 43 */
#define ERAY0_WRDS_1S42 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4A8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S42.
* To use register names with standard convension, please use ERAY0_WRDS_1S42.
*/
#define ERAY0_WRDS43 (ERAY0_WRDS_1S42)

/** \brief 4AC, Write Data Section 44 */
#define ERAY0_WRDS_1S43 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4ACu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S43.
* To use register names with standard convension, please use ERAY0_WRDS_1S43.
*/
#define ERAY0_WRDS44 (ERAY0_WRDS_1S43)

/** \brief 4B0, Write Data Section 45 */
#define ERAY0_WRDS_1S44 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4B0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S44.
* To use register names with standard convension, please use ERAY0_WRDS_1S44.
*/
#define ERAY0_WRDS45 (ERAY0_WRDS_1S44)

/** \brief 4B4, Write Data Section 46 */
#define ERAY0_WRDS_1S45 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4B4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S45.
* To use register names with standard convension, please use ERAY0_WRDS_1S45.
*/
#define ERAY0_WRDS46 (ERAY0_WRDS_1S45)

/** \brief 4B8, Write Data Section 47 */
#define ERAY0_WRDS_1S46 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4B8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S46.
* To use register names with standard convension, please use ERAY0_WRDS_1S46.
*/
#define ERAY0_WRDS47 (ERAY0_WRDS_1S46)

/** \brief 4BC, Write Data Section 48 */
#define ERAY0_WRDS_1S47 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4BCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S47.
* To use register names with standard convension, please use ERAY0_WRDS_1S47.
*/
#define ERAY0_WRDS48 (ERAY0_WRDS_1S47)

/** \brief 4C0, Write Data Section 49 */
#define ERAY0_WRDS_1S48 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4C0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S48.
* To use register names with standard convension, please use ERAY0_WRDS_1S48.
*/
#define ERAY0_WRDS49 (ERAY0_WRDS_1S48)

