HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxEray_reg.h
/** \brief 4C4, Write Data Section 50 */
#define ERAY0_WRDS_1S49 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4C4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S49.
* To use register names with standard convension, please use ERAY0_WRDS_1S49.
*/
#define ERAY0_WRDS50 (ERAY0_WRDS_1S49)

/** \brief 4C8, Write Data Section 51 */
#define ERAY0_WRDS_1S50 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4C8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S50.
* To use register names with standard convension, please use ERAY0_WRDS_1S50.
*/
#define ERAY0_WRDS51 (ERAY0_WRDS_1S50)

/** \brief 4CC, Write Data Section 52 */
#define ERAY0_WRDS_1S51 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4CCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S51.
* To use register names with standard convension, please use ERAY0_WRDS_1S51.
*/
#define ERAY0_WRDS52 (ERAY0_WRDS_1S51)

/** \brief 4D0, Write Data Section 53 */
#define ERAY0_WRDS_1S52 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4D0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S52.
* To use register names with standard convension, please use ERAY0_WRDS_1S52.
*/
#define ERAY0_WRDS53 (ERAY0_WRDS_1S52)

/** \brief 4D4, Write Data Section 54 */
#define ERAY0_WRDS_1S53 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4D4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S53.
* To use register names with standard convension, please use ERAY0_WRDS_1S53.
*/
#define ERAY0_WRDS54 (ERAY0_WRDS_1S53)

/** \brief 4D8, Write Data Section 55 */
#define ERAY0_WRDS_1S54 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4D8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S54.
* To use register names with standard convension, please use ERAY0_WRDS_1S54.
*/
#define ERAY0_WRDS55 (ERAY0_WRDS_1S54)

/** \brief 4DC, Write Data Section 56 */
#define ERAY0_WRDS_1S55 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4DCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S55.
* To use register names with standard convension, please use ERAY0_WRDS_1S55.
*/
#define ERAY0_WRDS56 (ERAY0_WRDS_1S55)

/** \brief 4E0, Write Data Section 57 */
#define ERAY0_WRDS_1S56 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4E0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S56.
* To use register names with standard convension, please use ERAY0_WRDS_1S56.
*/
#define ERAY0_WRDS57 (ERAY0_WRDS_1S56)

/** \brief 4E4, Write Data Section 58 */
#define ERAY0_WRDS_1S57 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4E4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S57.
* To use register names with standard convension, please use ERAY0_WRDS_1S57.
*/
#define ERAY0_WRDS58 (ERAY0_WRDS_1S57)

/** \brief 4E8, Write Data Section 59 */
#define ERAY0_WRDS_1S58 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4E8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S58.
* To use register names with standard convension, please use ERAY0_WRDS_1S58.
*/
#define ERAY0_WRDS59 (ERAY0_WRDS_1S58)

/** \brief 4EC, Write Data Section 60 */
#define ERAY0_WRDS_1S59 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4ECu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S59.
* To use register names with standard convension, please use ERAY0_WRDS_1S59.
*/
#define ERAY0_WRDS60 (ERAY0_WRDS_1S59)

/** \brief 4F0, Write Data Section 61 */
#define ERAY0_WRDS_1S60 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4F0u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S60.
* To use register names with standard convension, please use ERAY0_WRDS_1S60.
*/
#define ERAY0_WRDS61 (ERAY0_WRDS_1S60)

/** \brief 4F4, Write Data Section 62 */
#define ERAY0_WRDS_1S61 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4F4u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S61.
* To use register names with standard convension, please use ERAY0_WRDS_1S61.
*/
#define ERAY0_WRDS62 (ERAY0_WRDS_1S61)

/** \brief 4F8, Write Data Section 63 */
#define ERAY0_WRDS_1S62 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4F8u)
/** Alias (User Manual Name) for ERAY0_WRDS_1S62.
* To use register names with standard convension, please use ERAY0_WRDS_1S62.
*/
#define ERAY0_WRDS63 (ERAY0_WRDS_1S62)

/** \brief 4FC, Write Data Section 64 */
#define ERAY0_WRDS_1S63 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRDS*)0xF001C4FCu)
/** Alias (User Manual Name) for ERAY0_WRDS_1S63.
* To use register names with standard convension, please use ERAY0_WRDS_1S63.
*/
#define ERAY0_WRDS64 (ERAY0_WRDS_1S63)

/** \brief 500, Write Header Section 1 */
#define ERAY0_WRHS1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRHS1*)0xF001C500u)

/** \brief 504, Write Header Section 2 */
#define ERAY0_WRHS2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRHS2*)0xF001C504u)

/** \brief 508, Write Header Section 3 */
#define ERAY0_WRHS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_WRHS3*)0xF001C508u)

/** \brief 510, Input Buffer Command Mask */
#define ERAY0_IBCM /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_IBCM*)0xF001C510u)

/** \brief 514, Input Buffer Command Request */
#define ERAY0_IBCR /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_IBCR*)0xF001C514u)

/** \brief 600, Read Data Section 1 */
#define ERAY0_RDDS_1S0 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C600u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S0.
* To use register names with standard convension, please use ERAY0_RDDS_1S0.
*/
#define ERAY0_RDDS01 (ERAY0_RDDS_1S0)

/** \brief 604, Read Data Section 2 */
#define ERAY0_RDDS_1S1 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C604u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S1.
* To use register names with standard convension, please use ERAY0_RDDS_1S1.
*/
#define ERAY0_RDDS02 (ERAY0_RDDS_1S1)

/** \brief 608, Read Data Section 3 */
#define ERAY0_RDDS_1S2 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C608u)
/** Alias (User Manual Name) for ERAY0_RDDS_1S2.
* To use register names with standard convension, please use ERAY0_RDDS_1S2.
*/
#define ERAY0_RDDS03 (ERAY0_RDDS_1S2)

/** \brief 60C, Read Data Section 4 */
#define ERAY0_RDDS_1S3 /*lint --e(923, 9078)*/ (*(volatile Ifx_ERAY_RDDS*)0xF001C60Cu)
/** Alias (User Manual Name) for ERAY0_RDDS_1S3.
* To use register names with standard convension, please use ERAY0_RDDS_1S3.
*/
#define ERAY0_RDDS04 (ERAY0_RDDS_1S3)

